Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.ExportMullions
Indicates if to specify the setting for exporting mullions.
Remarks:
When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical
shading surface is produced from a mullion based on its centerline, thickness and offset.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.SimplifyCurtainSystems
Indicates if to specify the setting for simplified curtain systems.
Remarks:
Curtain Walls and Curtain Systems are normally exported as several openings, panel by panel,
while for energy analysis all you need is one giant window. A curtain wall with 50 panels
gets exported as 50 openings, while 1 opening with the total opening area would be more appropriate.
When this setting is on, one "large" window/opening will be exported for a curtain wall/system
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.IncludeShadingSurfaces
Indicates if to set and get the setting for if shading surfaces should be included.
Remarks:
The default is to include the shading surfaces.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.Tier
Level of computation for energy analysis model.
Remarks:
The default value is EnergyAnalysisModelTier::Final.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.EnergyModelType
It indicates whether the energy model is based on rooms/spaces or building elements.
Remarks:
The default value is EnergyModelType::SpatialElement.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions.#ctor
Constructs default options for energy analysis detailed model creation.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions
Options that govern the calculations for the generation of the energy analysis detail model.
Since:
2012